docs/2026-03-23_benchmark_scripts/gateway-comparison/results/litellm_chat_nonstream_hey.txt

Summary:
  Total:	0.4530 secs
  Slowest:	0.0536 secs
  Fastest:	0.0027 secs
  Average:	0.0218 secs
  Requests/sec:	2207.3981

  Total data:	514000 bytes
  Size/request:	514 bytes

Response time histogram:
  0.003 [1]	|
  0.008 [4]	|
  0.013 [9]	|■
  0.018 [42]	|■■
  0.023 [720]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.028 [185]	|■■■■■■■■■■
  0.033 [16]	|■
  0.038 [12]	|■
  0.043 [4]	|
  0.049 [6]	|
  0.054 [1]	|


Latency distribution:
  10%% in 0.0190 secs
  25%% in 0.0202 secs
  50%% in 0.0213 secs
  75%% in 0.0227 secs
  90%% in 0.0252 secs
  95%% in 0.0269 secs
  99%% in 0.0399 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0033 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0008 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0010 secs
  resp wait:	0.0216 secs, 0.0027 secs, 0.0505 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [200]	1000 responses